Revit 2027 API
Curve.Clone Method
Returns a copy of this curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve Clone()
Public Function Clone As Curve
public:
Curve^ Clone()
member Clone : unit -> Curve
Return Value
Curve
A copy of this curve.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace